Repository: GigaDuckAI/conduck
Catalog: Conduck/Conduck/Localizable.xcstrings
Source language: en
Languages: es, ja, zh_hans

# remoteAgent.editor.timeout.selfHosted
source: The test timed out waiting for %@. Check the gateway is running, then test again.
es: La prueba agotó el tiempo de espera para %@. Comprueba que la pasarela esté en funcionamiento y repite la prueba.
ja: %@の応答待ちでテストがタイムアウトしました。ゲートウェイが稼働していることを確認して再テストしてください。
zh_hans: 等待 %@ 的测试超时，请确认网关正在运行后再次测试。

# remoteAgent.editor.unreachable.hosted
source: Couldn't reach OpenRouter. Check your internet connection and try again.
es: No se pudo conectar con OpenRouter. Comprueba tu conexión a internet y vuelve a intentarlo.
ja: OpenRouterに接続できませんでした。インターネット接続を確認して再試行してください。
zh_hans: 无法连接 OpenRouter，请检查互联网连接后重试。

# remoteAgent.editor.unreachable.hosted.v2
source: Couldn't reach %@. Check your internet connection, then test again.
es: No se pudo conectar con %@. Comprueba tu conexión a internet y repite la prueba.
ja: %@に接続できませんでした。インターネット接続を確認して再テストしてください。
zh_hans: 无法连接 %@，请检查互联网连接后再次测试。

# remoteAgent.editor.unreachable.selfHosted
source: Couldn't reach %@. Check the gateway is running and reachable from this device, then test again.
es: No se pudo conectar con %@. Comprueba que la pasarela esté en funcionamiento y sea accesible desde este dispositivo y repite la prueba.
ja: %@に接続できませんでした。ゲートウェイが稼働し、このデバイスから接続できることを確認して再テストしてください。
zh_hans: 无法连接 %@，请确认网关正在运行且此设备能够访问，再次测试。

# remoteAgent.empty.macBody
source: Open Settings to add your gateway URL and bearer token, then press ⌘⇧1 to start a conversation.
es: Abre Ajustes para añadir la URL de tu pasarela y su token de portador; luego pulsa ⌘⇧1 para iniciar una conversación.
ja: 設定でゲートウェイURLとBearer認証トークンを追加し、⌘⇧1で会話を始めてください。
zh_hans: 打开“设置”添加网关 URL 和 Bearer 令牌，然后按 ⌘⇧1 开始对话。

# remoteAgent.empty.openSettings
source: Open Settings
es: Abrir Ajustes
ja: 設定を開く
zh_hans: 打开设置

# remoteAgent.empty.title
source: Connect your personal AI
es: Conectar tu IA personal
ja: パーソナルAIに接続
zh_hans: 连接个人 AI

# remoteAgent.error.authFailed
source: Could not authenticate with your personal AI.
es: No se pudo autenticar con tu IA personal.
ja: パーソナルAIの認証ができませんでした。
zh_hans: 无法通过个人 AI 的身份验证。

# remoteAgent.error.authFailed.recovery
source: Open Settings and verify the bearer token for your gateway.
es: Abre Ajustes y verifica el token de portador de tu pasarela.
ja: 設定でゲートウェイのBearer認証トークンを確認してください。
zh_hans: 打开“设置”，检查网关的 Bearer 令牌。

# remoteAgent.error.authFailed.recovery.hosted
source: Check your API key in your provider's dashboard, then paste it again.
es: Comprueba tu clave de API en el panel de tu proveedor y vuelve a pegarla.
ja: プロバイダーのダッシュボードでAPIキーを確認し、もう一度貼り付けてください。
zh_hans: 请在服务商的控制面板中检查 API 密钥，然后重新粘贴。

# remoteAgent.error.authFailed.recovery.v3
source: Check the key if your server needs one, and check anything in front of it — a proxy or tunnel can forward the request in a form it refuses.
es: Comprueba la clave si tu servidor necesita una y revisa cualquier servicio que tenga delante: un proxy o túnel puede reenviar la solicitud en un formato que rechace.
ja: サーバーがキーを必要とする場合はキーを確認し、前段のプロキシやトンネルも確認してください。リクエストがサーバーに拒否される形式で転送されている可能性があります。
zh_hans: 如果服务器需要密钥，请检查密钥，并检查前置代理或隧道，它们可能以服务器不接受的形式转发了请求。

# remoteAgent.error.authFailed.v3
source: The request to your AI was refused.
es: La solicitud a tu IA fue rechazada.
ja: AIへのリクエストが拒否されました。
zh_hans: 发往 AI 的请求被拒绝。

# remoteAgent.error.certKeyUnpinnable
source: Your gateway's certificate uses a key type Conduck can't fingerprint, so your pinned fingerprint can't be checked.
es: El certificado de tu pasarela usa un tipo de clave cuya huella Conduck no puede calcular, por lo que no se puede comprobar la huella fijada.
ja: ゲートウェイの証明書の鍵形式にConduckが対応していないため、固定したフィンガープリントを確認できません。
zh_hans: 网关证书的密钥类型不支持生成指纹，Conduck 无法核验你固定的指纹。

# remoteAgent.error.certMismatch
source: Your gateway's certificate doesn't match the fingerprint you pinned.
es: El certificado de tu pasarela no coincide con la huella que fijaste.
ja: ゲートウェイの証明書が、固定したフィンガープリントと一致しません。
zh_hans: 网关证书与固定的指纹不符。

# remoteAgent.error.certUntrusted
source: This device doesn't trust your gateway's certificate.
es: Este dispositivo no confía en el certificado de tu pasarela.
ja: このデバイスはゲートウェイの証明書を信頼していません。
zh_hans: 此设备不信任网关的证书。

# remoteAgent.error.contextTooLong
source: This chat got too long for the model.
es: Este chat es demasiado largo para el modelo.
ja: このチャットはモデルが扱える長さを超えました。
zh_hans: 此对话超出了模型的上下文容量。

# remoteAgent.error.contextTooLong.recovery
source: Start a new chat, or switch to a model with a bigger context window.
es: Inicia un chat nuevo o cambia a un modelo con una ventana de contexto mayor.
ja: 新しいチャットを始めるか、より大きいコンテキストウィンドウのモデルに切り替えてください。
zh_hans: 请新建对话，或换用上下文窗口更大的模型。

# remoteAgent.error.contextTooLong.recovery.serverChosen
source: Start a new chat to shorten the history.
es: Inicia un chat nuevo para acortar el historial.
ja: 新しいチャットを始めて履歴を短くしてください。
zh_hans: 请新建对话，减少历史内容。

# remoteAgent.error.defaultNeedsSetup.recovery
source: Your other AIs still work. Open Settings → Personal AI and pick one for new chats.
es: Tus otras IA siguen funcionando. Abre Ajustes → IA personal y elige una para los chats nuevos.
ja: ほかのAIは引き続き使えます。設定 → パーソナルAIで、新しいチャットに使うAIを選んでください。
zh_hans: 其他 AI 仍然可用。打开“设置”→“个人 AI”，选择一个用于新对话。

# remoteAgent.error.defaultNeedsSetup.unnamed
source: Conduck doesn't know which AI to use for new chats.
es: Conduck no sabe qué IA usar para los chats nuevos.
ja: 新しいチャットに使うAIが設定されていません。
zh_hans: Conduck 尚未确定新对话使用哪个 AI。

# remoteAgent.error.defaultUnavailable
source: Your default AI, %@, isn't available on this device.
es: Tu IA predeterminada, %@, no está disponible en este dispositivo.
ja: デフォルトのAI「%@」はこのデバイスでは利用できません。
zh_hans: 默认 AI %@ 在此设备上不可用。

# remoteAgent.error.endpointNotFound
source: Your gateway didn't recognise the AI endpoint.
es: Tu pasarela no reconoció el punto de conexión de IA.
ja: ゲートウェイがAIエンドポイントを認識しませんでした。
zh_hans: 网关无法识别 AI 端点。

# remoteAgent.error.endpointNotFound.hosted
source: Your AI provider didn't recognise the route.
es: Tu proveedor de IA no reconoció la ruta.
ja: AIプロバイダーがルートを認識しませんでした。
zh_hans: AI 服务商无法识别此路由。

# remoteAgent.error.endpointNotFound.recovery
source: Check the Gateway URL is your server's base address, not a full /v1/… path.
es: Comprueba que la URL de la pasarela sea la dirección base de tu servidor, no una ruta completa /v1/….
ja: ゲートウェイURLが、/v1/…を含む完全なパスではなく、サーバーのベースアドレスであることを確認してください。
zh_hans: 请确认网关 URL 是服务器的基础地址，而非完整的 /v1/… 路径。

# remoteAgent.error.endpointNotFound.recovery.hosted
source: The provider didn't recognise that route. Try again in a moment.
es: El proveedor no reconoció esa ruta. Inténtalo de nuevo en un momento.
ja: プロバイダーがそのルートを認識しませんでした。少し待ってから再試行してください。
zh_hans: 服务商无法识别此路由，请稍后重试。

# remoteAgent.error.endpointUnexpectedResponse
source: Your gateway answered, but not like an AI endpoint.
es: Tu pasarela respondió, pero no como un punto de conexión de IA.
ja: ゲートウェイから応答がありましたが、AIエンドポイントの応答ではありませんでした。
zh_hans: 网关有响应，但响应不像 AI 端点。

# remoteAgent.error.endpointUnexpectedResponse.hosted
source: Something answered, but not like an AI endpoint.
es: Algo respondió, pero no como un punto de conexión de IA.
ja: 応答がありましたが、AIエンドポイントの応答ではありませんでした。
zh_hans: 有服务响应，但响应不像 AI 端点。

# remoteAgent.error.endpointUnexpectedResponse.recovery
source: It answered with something other than an AI endpoint's data. The endpoint may be switched off on your server, or the URL may point at a web page.
es: Respondió con datos distintos de los de un punto de conexión de IA. Puede que ese punto de conexión esté desactivado en tu servidor o que la URL apunte a una página web.
ja: AIエンドポイントのデータ以外が返されました。サーバーのエンドポイントが無効になっているか、URLがWebページを指している可能性があります。
zh_hans: 响应内容并非 AI 端点数据。服务器可能关闭了该端点，或 URL 指向了网页。

# remoteAgent.error.endpointUnexpectedResponse.recovery.hosted
source: Something other than the provider answered. Check the network you're on, then try again.
es: Respondió algo distinto del proveedor. Comprueba la red en la que estás y vuelve a intentarlo.
ja: プロバイダー以外から応答がありました。接続中のネットワークを確認して再試行してください。
zh_hans: 响应来自服务商以外的服务。请检查当前网络后重试。

# remoteAgent.error.endpointWrongEnvelope
source: Your gateway answered JSON, but not in the shape Conduck needs.
es: Tu pasarela respondió con JSON, pero no con la estructura que necesita Conduck.
ja: ゲートウェイからJSONが返されましたが、Conduckが必要とする構造ではありません。
zh_hans: 网关返回了 JSON，但格式不符合 Conduck 的要求。

# remoteAgent.error.endpointWrongEnvelope.hosted
source: Something answered JSON, but not in the shape Conduck needs.
es: Algo respondió con JSON, pero no con la estructura que necesita Conduck.
ja: JSONが返されましたが、Conduckが必要とする構造ではありません。
zh_hans: 有服务返回了 JSON，但格式不符合 Conduck 的要求。

# remoteAgent.error.endpointWrongEnvelope.recovery
source: The /v1/models reply must be an object with a top-level "data" array. Contract: conduck.com/setup/adapter/v1
es: La respuesta de /v1/models debe ser un objeto con un array "data" en el nivel superior. Contrato: conduck.com/setup/adapter/v1
ja: /v1/modelsの応答は、最上位に「data」配列を持つオブジェクトである必要があります。仕様：conduck.com/setup/adapter/v1
zh_hans: /v1/models 的响应必须是包含顶层 "data" 数组的对象。协议规范：conduck.com/setup/adapter/v1

# remoteAgent.error.imageTooLarge
source: An attached image was too large for your gateway.
es: Una imagen adjunta era demasiado grande para tu pasarela.
ja: 添付画像がゲートウェイの上限を超えています。
zh_hans: 附加图片超过了网关允许的大小。

# remoteAgent.error.imageTooLarge.hosted
source: An attached image was too large for your AI.
es: Una imagen adjunta era demasiado grande para tu IA.
ja: 添付画像がAIの上限を超えています。
zh_hans: 附加图片超过了 AI 允许的大小。

# remoteAgent.error.imageTooLarge.recovery
source: Your gateway rejected the image as too large. Try a smaller image, or raise your gateway's image-size limit.
es: Tu pasarela rechazó la imagen por ser demasiado grande. Prueba con una más pequeña o aumenta el límite de tamaño de imágenes de tu pasarela.
ja: ゲートウェイが画像サイズを理由に拒否しました。小さい画像を使うか、ゲートウェイの画像サイズ上限を上げてください。
zh_hans: 网关因图片过大而拒绝接收。请缩小图片，或提高网关的图片大小限制。

# remoteAgent.error.imageTooLarge.recovery.hosted
source: Try a smaller image.
es: Prueba con una imagen más pequeña.
ja: 小さい画像をお試しください。
zh_hans: 请使用较小的图片。

# remoteAgent.error.insecureBlocked
source: iOS blocked this unencrypted connection.
es: iOS bloqueó esta conexión sin cifrar.
ja: iOSがこの暗号化されていない接続をブロックしました。
zh_hans: iOS 阻止了此未加密连接。

# remoteAgent.error.insecureBlocked.recovery
source: Plain http:// only reaches an address on your own network. Use the server's IP address, or put it behind https://.
es: http:// sin cifrado solo permite acceder a una dirección de tu propia red. Usa la dirección IP del servidor o ponlo detrás de https://.
ja: 暗号化されていないhttp://は、自分のネットワーク内のアドレスにのみ使えます。サーバーのIPアドレスを使うか、https://で接続できるように設定してください。
zh_hans: 普通 http:// 只允许访问本地网络地址。请使用服务器的 IP 地址，或通过 https:// 提供服务。

# remoteAgent.error.insecureBlocked.recovery.v2
source: Plain http:// only reaches an address on your own network. Use the server's IP address or its .local name, or put it behind https://.
es: http:// sin cifrado solo permite acceder a una dirección de tu propia red. Usa la dirección IP del servidor o su nombre .local, o ponlo detrás de https://.
ja: 暗号化されていないhttp://は、自分のネットワーク内のアドレスにのみ使えます。サーバーのIPアドレスか.local名を使うか、https://で接続できるように設定してください。
zh_hans: 普通 http:// 只允许访问本地网络地址。请使用服务器的 IP 地址或 .local 名称，或通过 https:// 提供服务。

# remoteAgent.error.insecureBlocked.v2
source: Apple blocked this unencrypted address.
es: Apple bloqueó esta dirección sin cifrar.
ja: Appleがこの暗号化されていないアドレスをブロックしました。
zh_hans: Apple 阻止了此未加密地址。

# remoteAgent.error.invalidResponse
source: Your personal AI returned an unexpected response.
es: Tu IA personal devolvió una respuesta inesperada.
ja: パーソナルAIから予期しない応答が返されました。
zh_hans: 个人 AI 返回了意外响应。

# remoteAgent.error.invalidResponse.recovery
source: Check the gateway is running an OpenAI-compatible /v1/chat/completions endpoint.
es: Comprueba que la pasarela tenga un punto de conexión /v1/chat/completions compatible con OpenAI en funcionamiento.
ja: ゲートウェイでOpenAI互換の/v1/chat/completionsエンドポイントが稼働していることを確認してください。
zh_hans: 请确认网关提供兼容 OpenAI 的 /v1/chat/completions 端点。

# remoteAgent.error.invalidResponse.recovery.hosted
source: Try again, or pick a different model.
es: Inténtalo de nuevo o elige otro modelo.
ja: 再試行するか、別のモデルを選んでください。
zh_hans: 请重试，或选择其他模型。

# remoteAgent.error.invalidResponse.v2
source: Your AI returned an unexpected response.
es: Tu IA devolvió una respuesta inesperada.
ja: AIから予期しない応答が返されました。
zh_hans: AI 返回了意外响应。

# remoteAgent.error.modelRequired
source: Your gateway needs you to name a model.
es: Tu pasarela necesita que indiques un modelo.
ja: ゲートウェイにモデル名の指定が必要です。
zh_hans: 网关要求指定模型名称。

# remoteAgent.error.modelRequired.hosted
source: Your AI needs you to name a model.
es: Tu IA necesita que indiques un modelo.
ja: AIにモデル名の指定が必要です。
zh_hans: AI 要求指定模型名称。

# remoteAgent.error.modelRequired.recovery
source: Open this gateway's settings and set a Model, for example llama3.
es: Abre los ajustes de esta pasarela y define un Modelo, por ejemplo llama3.
ja: このゲートウェイの設定を開き、モデル（例：llama3）を設定してください。
zh_hans: 打开此网关的设置并填写“模型”，例如 llama3。

# remoteAgent.error.modelRequired.recovery.hosted
source: Open Settings → Personal AI and pick a model.
es: Abre Ajustes → IA personal y elige un modelo.
ja: 設定 → パーソナルAIでモデルを選んでください。
zh_hans: 打开“设置”→“个人 AI”，选择模型。

# remoteAgent.error.modelRequired.recovery.serverChosen
source: Set a default model on your server, then try again.
es: Define un modelo predeterminado en tu servidor y vuelve a intentarlo.
ja: サーバーでデフォルトのモデルを設定して再試行してください。
zh_hans: 请在服务器上设置默认模型，再重试。

# remoteAgent.error.modelUnavailable
source: That AI model isn't available.
es: Ese modelo de IA no está disponible.
ja: そのAIモデルは利用できません。
zh_hans: 该 AI 模型不可用。

# remoteAgent.error.modelUnavailable.recovery
source: Check the model name in Settings, or pick a different one.
es: Comprueba el nombre del modelo en Ajustes o elige otro.
ja: 設定でモデル名を確認するか、別のモデルを選んでください。
zh_hans: 请检查“设置”中的模型名称，或选择其他模型。

# remoteAgent.error.modelUnavailable.recovery.serverChosen
source: Check the model configured on your server.
es: Comprueba el modelo configurado en tu servidor.
ja: サーバーに設定したモデルを確認してください。
zh_hans: 请检查服务器配置的模型。

# remoteAgent.error.notConfigured
source: No personal AI gateway is configured.
es: No hay ninguna pasarela de IA personal configurada.
ja: パーソナルAIのゲートウェイが設定されていません。
zh_hans: 尚未配置个人 AI 网关。

# remoteAgent.error.notConfigured.recovery
source: Open Settings → Personal AI and add a URL and bearer token.
es: Abre Ajustes → IA personal y añade una URL y un token de portador.
ja: 設定 → パーソナルAIでURLとBearer認証トークンを追加してください。
zh_hans: 打开“设置”→“个人 AI”，添加 URL 和 Bearer 令牌。

# remoteAgent.error.notConfigured.recovery.hosted
source: Open Settings → Personal AI and add your key.
es: Abre Ajustes → IA personal y añade tu clave.
ja: 設定 → パーソナルAIでキーを追加してください。
zh_hans: 打开“设置”→“个人 AI”，添加密钥。

# remoteAgent.error.notConfigured.recovery.v2
source: Open Settings → Personal AI and add its address and key.
es: Abre Ajustes → IA personal y añade su dirección y clave.
ja: 設定 → パーソナルAIでアドレスとキーを追加してください。
zh_hans: 打开“设置”→“个人 AI”，添加地址和密钥。

# remoteAgent.error.notConfigured.v2
source: No AI is configured.
es: No hay ninguna IA configurada.
ja: AIが設定されていません。
zh_hans: 尚未配置 AI。

# remoteAgent.error.notEstablished
source: Conduck couldn't open a connection to your gateway.
es: Conduck no pudo abrir una conexión con tu pasarela.
ja: Conduckからゲートウェイに接続できませんでした。
zh_hans: Conduck 无法建立到网关的连接。

# remoteAgent.error.notEstablished.hosted
source: Conduck couldn't open a connection to your AI.
es: Conduck no pudo abrir una conexión con tu IA.
ja: ConduckからAIに接続できませんでした。
zh_hans: Conduck 无法建立到 AI 的连接。

# remoteAgent.error.notEstablished.recovery
source: Check the address is still current and the gateway is running. The request most likely never reached it.
es: Comprueba que la dirección siga siendo válida y que la pasarela esté en funcionamiento. Lo más probable es que la solicitud nunca llegara a ella.
ja: アドレスが現在も有効で、ゲートウェイが稼働していることを確認してください。リクエストが届いていない可能性が高いです。
zh_hans: 请确认地址仍然有效且网关正在运行。此请求很可能尚未到达网关。

# remoteAgent.error.notEstablished.recovery.hosted
source: Check your internet connection. The request most likely never left this device.
es: Comprueba tu conexión a internet. Lo más probable es que la solicitud nunca saliera de este dispositivo.
ja: インターネット接続を確認してください。リクエストがこのデバイスから送られていない可能性が高いです。
zh_hans: 请检查互联网连接。此请求很可能尚未离开本设备。

# remoteAgent.error.outOfCredits
source: Your AI provider is out of credits.
es: Tu proveedor de IA no tiene créditos.
ja: AIプロバイダーのクレジット残高が不足しています。
zh_hans: AI 服务商的账户余额已用完。

# remoteAgent.error.outOfCredits.recovery
source: Add credits with your provider, then try again.
es: Añade créditos con tu proveedor y vuelve a intentarlo.
ja: プロバイダーでクレジットを追加して再試行してください。
zh_hans: 请向服务商账户充值后重试。

# remoteAgent.error.rateLimited
source: Your AI provider is rate-limiting you.
es: Tu proveedor de IA está limitando la frecuencia de tus solicitudes.
ja: AIプロバイダーの利用制限がかかっています。
zh_hans: AI 服务商正在限制请求频率。

# remoteAgent.error.rateLimited.recovery
source: Wait a moment, then try again — free models often have daily limits.
es: Espera un momento y vuelve a intentarlo: los modelos gratuitos suelen tener límites diarios.
ja: 少し待ってから再試行してください。無料モデルには1日ごとの利用上限があることがよくあります。
zh_hans: 请稍后重试。免费模型通常有每日限额。

# remoteAgent.error.serverError
source: Your personal AI gateway reported an error.
es: Tu pasarela de IA personal indicó un error.
ja: パーソナルAIのゲートウェイからエラーが返されました。
zh_hans: 个人 AI 网关报告了错误。

# remoteAgent.error.serverError.recovery
source: Check the gateway logs, then try again.
es: Revisa los registros de la pasarela y vuelve a intentarlo.
ja: ゲートウェイのログを確認して再試行してください。
zh_hans: 请检查网关日志后重试。

# remoteAgent.error.serverError.recovery.hosted
source: Try again in a moment.
es: Inténtalo de nuevo en un momento.
ja: 少し待ってから再試行してください。
zh_hans: 请稍后重试。

# remoteAgent.error.serverError.v2
source: Your AI reported an error.
es: Tu IA indicó un error.
ja: AIからエラーが返されました。
zh_hans: AI 报告了错误。

# remoteAgent.error.serviceUnavailable
source: A server involved in this connection is temporarily unavailable.
es: Un servidor que participa en esta conexión no está disponible temporalmente.
ja: この接続に関わるサーバーが一時的に利用できません。
zh_hans: 此连接中的某个服务器暂时不可用。

# remoteAgent.error.serviceUnavailable.recovery
source: Check your gateway, anything in front of it such as a tunnel or proxy, and the model provider it uses.
es: Revisa tu pasarela, cualquier servicio que tenga delante, como un túnel o proxy, y el proveedor de modelos que usa.
ja: ゲートウェイと、その前段のトンネルやプロキシ、使用しているモデルプロバイダーを確認してください。
zh_hans: 请检查网关、它前面的隧道或代理，以及它使用的模型服务商。

# remoteAgent.error.serviceUnavailable.recovery.hosted
source: The provider or something on the route is unavailable. Try again shortly.
es: El proveedor o algún servicio de la ruta no está disponible. Inténtalo de nuevo en breve.
ja: プロバイダーまたは接続経路が利用できません。少し待ってから再試行してください。
zh_hans: 服务商或连接路径上的某个服务不可用，请稍后重试。

# remoteAgent.error.stoppedBeforeSend
source: You stopped this message before it was sent.
es: Detuviste este mensaje antes de que se enviara.
ja: 送信前にこのメッセージを停止しました。
zh_hans: 你在发送前停止了这条消息。

# remoteAgent.error.stoppedBeforeSend.recovery
source: Nothing left this device, so nothing reached your AI. Send it again whenever you like.
es: Nada salió de este dispositivo, así que nada llegó a tu IA. Envíalo de nuevo cuando quieras.
ja: このデバイスから何も送られていないため、AIにも届いていません。いつでも再送できます。
zh_hans: 内容未离开本设备，AI 未收到任何内容。你可以随时重新发送。

# remoteAgent.error.timeout
source: Your personal AI took too long to respond.
es: Tu IA personal tardó demasiado en responder.
ja: パーソナルAIからの応答に時間がかかりすぎました。
zh_hans: 个人 AI 响应时间过长。

# remoteAgent.error.timeout.recovery
source: Try again — the gateway may be processing a long reply.
es: Inténtalo de nuevo: la pasarela puede estar procesando una respuesta larga.
ja: 再試行してください。ゲートウェイが長い返信を処理している可能性があります。
zh_hans: 请重试，网关可能正在处理较长的回复。

# remoteAgent.error.timeout.recovery.hosted
source: It may still be working on this one. Another attempt could repeat the work and the cost.
es: Puede que aún esté trabajando en esto. Otro intento podría repetir el trabajo y el coste.
ja: まだ処理中の可能性があります。再試行すると、処理と料金が重複するおそれがあります。
zh_hans: 它可能仍在处理此请求。再次尝试可能重复执行任务并产生费用。

# remoteAgent.error.timeout.recovery.v2
source: It may still be working on this one. Check the gateway before trying again, because another attempt could repeat the work and the cost.
es: Puede que aún esté trabajando en esto. Revisa la pasarela antes de volver a intentarlo, porque otro intento podría repetir el trabajo y el coste.
ja: まだ処理中の可能性があります。再試行すると処理と料金が重複するおそれがあるため、先にゲートウェイを確認してください。
zh_hans: 它可能仍在处理此请求。再次尝试可能重复执行任务并产生费用，请先检查网关。

# remoteAgent.error.timeout.v2
source: Your AI took too long to respond.
es: Tu IA tardó demasiado en responder.
ja: AIからの応答に時間がかかりすぎました。
zh_hans: AI 响应时间过长。

# remoteAgent.error.unexpectedStatus
source: Your gateway answered with HTTP %lld, which Conduck doesn't recognise.
es: Tu pasarela respondió con HTTP %lld, que Conduck no reconoce.
ja: ゲートウェイが、Conduckで認識できないHTTP %lldを返しました。
zh_hans: 网关返回了 Conduck 无法识别的 HTTP %lld。

# remoteAgent.error.unexpectedStatus.hosted
source: Your AI answered with HTTP %lld, which Conduck doesn't recognise.
es: Tu IA respondió con HTTP %lld, que Conduck no reconoce.
ja: AIが、Conduckで認識できないHTTP %lldを返しました。
zh_hans: AI 返回了 Conduck 无法识别的 HTTP %lld。

# remoteAgent.error.unexpectedStatus.recovery
source: That came from your server, or from something in front of it. Check both, then try again.
es: Eso vino de tu servidor o de algún servicio que tiene delante. Revisa ambos y vuelve a intentarlo.
ja: サーバーまたはその前段からの応答です。両方を確認して再試行してください。
zh_hans: 响应来自服务器或它前面的某个服务。请检查两者后重试。

# remoteAgent.error.unexpectedStatus.recovery.hosted
source: That came from the provider or the network between you. Try again.
es: Eso vino del proveedor o de la red entre ambos. Inténtalo de nuevo.
ja: プロバイダーまたは接続経路からの応答です。再試行してください。
zh_hans: 响应来自服务商或连接网络，请重试。

# remoteAgent.error.unexpectedStatus.unknown
source: Your gateway answered in a way Conduck doesn't recognise.
es: Tu pasarela respondió de una forma que Conduck no reconoce.
ja: ゲートウェイからConduckで認識できない応答が返されました。
zh_hans: 网关的响应无法被 Conduck 识别。

# remoteAgent.error.unexpectedStatus.unknown.hosted
source: Your AI answered in a way Conduck doesn't recognise.
es: Tu IA respondió de una forma que Conduck no reconoce.
ja: AIからConduckで認識できない応答が返されました。
zh_hans: AI 的响应无法被 Conduck 识别。

# remoteAgent.error.unknownHTTPStatus
source: Unknown error (HTTP %lld)
es: Error desconocido (HTTP %lld)
ja: 不明なエラー（HTTP %lld）
zh_hans: 未知错误（HTTP %lld）

# remoteAgent.error.unreachable
source: Could not reach your personal AI gateway.
es: No se pudo conectar con tu pasarela de IA personal.
ja: パーソナルAIに接続できませんでした。
zh_hans: 无法连接个人 AI 网关。

# remoteAgent.error.unreachable.recovery
source: Check the gateway is running and accessible from this device.
es: Comprueba que la pasarela esté en funcionamiento y sea accesible desde este dispositivo.
ja: ゲートウェイが稼働し、このデバイスから接続できることを確認してください。
zh_hans: 请确认网关正在运行且此设备能够访问。

# remoteAgent.error.unreachable.recovery.hosted
source: Check your internet connection, then try again. Conduck can't tell whether the request arrived.
es: Comprueba tu conexión a internet y vuelve a intentarlo. Conduck no puede saber si la solicitud llegó.
ja: インターネット接続を確認して再試行してください。Conduckではリクエストが届いたか判断できません。
zh_hans: 请检查互联网连接后重试。Conduck 无法确定请求是否已到达。

# remoteAgent.error.unreachable.recovery.v2
source: Check the gateway is reachable from this device. Conduck can't tell whether the request arrived, so if it could run tools, check the gateway before trying again.
es: Comprueba que la pasarela sea accesible desde este dispositivo. Conduck no puede saber si la solicitud llegó, así que, si podía ejecutar herramientas, revisa la pasarela antes de volver a intentarlo.
ja: このデバイスからゲートウェイに接続できることを確認してください。Conduckではリクエストが届いたか判断できないため、ツールを実行する可能性がある場合は、再試行前にゲートウェイを確認してください。
zh_hans: 请确认此设备能访问网关。Conduck 无法确定请求是否已到达；如果网关能调用工具，请先检查网关，再决定是否重试。
